package com.company.메뉴;

/**
 * Created by ce-416-28 on 2017-05-11.
 */
public class 메뉴판 {
    private 음식공장[] 음식;

    public 메뉴판(){
        음식 = new 음식공장[10];

        음식[0] = new 음식공장("잡채밥",9000);
        음식[1] = new 음식공장("볶음밥",6000);
        음식[2] = new 음식공장("정식",6000);
        음식[3] = new 음식공장("갈비탕",8000);
        음식[4] = new 음식공장("두루치기",8000);
        음식[5] = new 음식공장("비빔국수",6000);
        음식[6] = new 음식공장("고기국수",7000);
        음식[7] = new 음식공장("순두부찌게",6000);
        음식[8] = new 음식공장("김영란세트",30000);
        음식[9] = new 음식공장("패밀리세트",50000);
    }

    public void 메뉴출력(){
        for (int i = 1; i < 음식.length+1; i++ ){
            String 음식이름 = 음식[i-1].음식명받기();
            System.out.println(i +". "+ 음식이름);
        }
    }

    public 음식공장 음식얻기(int i){
        return 음식[i-1];
    }
}